88markus88/ESP32_Anchor_Alarm/src/ePaperAnchorAlarm.cpp
/*****************************************************************************! 
  @brief  setup routine
  @details 
  @return void
*****************************************************************************/
void setup()
{
  startTimeMillis = millis(); // remember time when woken up
  Serial.begin(115200);       // set speed for serial monitor

  logOut(2,(char*)"**********************************************************");
  sprintf(outstring,"* %s %s - %s ",PROGNAME, VERSION, BUILD_DATE);
  logOut(2,outstring);
  logOut(2,(char*)"**********************************************************");

  uint32_t size_wData = sizeof(wData);
  sprintf(outstring,"Size of wData: %d bytes. Remaining RTC Memory: %d bytes", size_wData, 4096-size_wData); 
  logOut(2,outstring);

  sprintf(wData.actConfigString,"free RTC: %d\n", 4096-size_wData);   

  // get and re-set CPU clock speed
  // https://deepbluembedded.com/esp32-change-cpu-speed-clock-frequency/
  uint32_t CPUFreq = getCpuFrequencyMhz();
  uint32_t XTALFreq = getXtalFrequencyMhz();
  uint32_t ABPFreq = getApbFrequency();
  delay(50);
  sprintf(outstring,"Orig.Frequencies: CPU: %ld MHz XTAL: %ld MHz ABP: %ld Hz", CPUFreq, XTALFreq, ABPFreq);
  logOut(2,outstring);

  //function takes the following frequencies as valid values:
  //  240, 160, 80    <<< For all XTAL types
  //  40, 20, 10      <<< For 40MHz XTAL
  //  26, 13          <<< For 26MHz XTAL
  //  24, 12          <<< For 24MHz XTAL
  uint32_t cpu_freq_mhz = 80;
  setCpuFrequencyMhz(cpu_freq_mhz);
  
  CPUFreq = getCpuFrequencyMhz();
  XTALFreq = getXtalFrequencyMhz();
  ABPFreq = getApbFrequency();
  
  sprintf(outstring,"New Frequencies: CPU: %ld MHz XTAL: %ld MHz ABP: %ld Hz", CPUFreq, XTALFreq, ABPFreq);
  logOut(2,outstring);
  sprintf(wData.actConfigString,"%sCPU: %ld MHz\n", wData.actConfigString, cpu_freq_mhz);


  #ifdef READ_PREFERENCES
    // get data from EEPROM using preferences library in readonly mode
    sprintf(outstring," before readPreferences()");
    logOut(2,outstring);
    readPreferences();
  #endif

  // increment start counter
  wData.startCounter++;

   // initialize rotary encoder
   ESP32Encoder::useInternalWeakPullResistors = puType::up;
   encoder.attachHalfQuad(ENCODER_CLK_PIN, ENCODER_DT_PIN);
   encoder.setCount(0);

  // button via interrupt
  pinMode(ENCODER_SW_PIN, INPUT_PULLUP);
  attachInterrupt(
    digitalPinToInterrupt(ENCODER_SW_PIN),
    handleButtonInterrupt,
    FALLING
  );

  // initialize the display
  logOut(2,(char*)"before initDisplay()");
  initDisplay(wData.startCounter, FULL_UPDATE_INTERVAL); 

  // Serial port for GPS module
  ss.begin(9600, SERIAL_8N1, RXPin, TXPin); // RX, TX
  gpsTimerHandle = gpsTimer.setInterval(200L, gpsHandler); // set gps test timer to 100 milliseconds

  //GPS aggressive for quick position Fix
  // smartDelay(500); // give GPS some time to start up
  // setPSM(1000); // 1s Update, does not work with NEO-6M
  //remove unnecessary NMEA messages to optimize GPS performance
  smartDelay(500); // give GPS some time to start up

  configureGpsMessages(); // working from gpsTest
  sprintf(wData.actConfigString,"%sconfigGPSMsg\n", wData.actConfigString);

  if(wData.currentMode == MODE_STARTED){ // tests only with fresh start, to prevent this stuff when waking up after sleep
    // show welcome message on ePaper
    char show[30];
    sprintf(show,"AnchorAlarm %s", VERSION);
    showWelcomeMessage(true, show);
    showWelcomeMessage(false,wData.actConfigString);

    // remove unnecessary NMEA messages to optimize GPS performance
    smartDelay(500); // give GPS some time to start up
    configureGpsMessages(); // working from gpsTest
    sprintf(wData.actConfigString,"%s2.configGPSMsg\n", wData.actConfigString);

    // configure GPS for "pedestrian" mode: good accuracy at slow speeds
    smartDelay(500); // give GPS some time to start up
    configurePedestrian();
    sprintf(wData.actConfigString,"%sconfigPedestrian\n", wData.actConfigString);

    // set power saving mode
    smartDelay(500); // give GPS some time to start up
    configureUKhasPSM();
    sprintf(wData.actConfigString,"%sconfigUKhasPSM\n", wData.actConfigString);
    
    // short display test
    if(testDisplayModule)
      testDisplay();  

    showWelcomeMessage(false, (char*)"Buzzer Test");

    if(testBuzzer)        // buzzer test
      //buzzer(1,100,500); 
      doParallelBuzzer(1,100,500);
    if(testDisplayModule) // display test, original from WeAct (manufacturer of the ePaper display)
      testDisplayWeAct();
    if(testBuzzer){       // buzzer test
      logOut(2,(char*)"Testing buzzer");
      for(int i=0; i<5; i++)
      {
         //buzzer(1,100,500-i*75); // buzzer test
         doParallelBuzzer(1,100,500);
         delay(1000); // needed for parallel buzzer
      } 
    }  

    boolean buttonPressed = false; 
    int64_t encoderPos = 0;
    if(testRotaryEncoder){
      showWelcomeMessage(false, (char*)"Encoder Test");
      for(int i=0;i<30;i++) {
        testRotary(&buttonPressed, &encoderPos );
        delay(500);
      }  
    }  

    if(testGPSModule){
      showWelcomeMessage(false, (char*)"GPS Test");
      logOut(2,(char*)"GPS serial started.");
      getGPSStartPosition(&startLat, &startLon); // get start position from GPS

      gps_offset(
        startLat,
        startLon,
        anchorDistance_m,
        anchorBearing_deg,
        &anchorLat,
        &anchorLon
      );
      Serial.print(F("Calculated anchor position: "));
      Serial.print(anchorLat, 6); 
      Serial.print(F(", "));
      Serial.println(anchorLon, 6);
    }
  }  // if just started

} // setup

/*****************************************************************************! 
  @brief  handleExt0Wakeup()
  @details handle wakeup by EXT0 wakeup source = button via GPIO 
  @return void
*****************************************************************************/
void handleExt0Wakeup()
{
    // if woken up by button remember this, may be alert acknowledge
    wData.buttonPressed = true;

    // if in alert mode
    if(!wData.alertON){
      // do something tbd
    } // !alertON
}

