88markus88/ESP32_Anchor_Alarm/src/ePaperAnchorAlarm.cpp
        if(wData.buttonPressed){ // button state is checked in main loop
          // wData.buttonPressed = false; // reset button pressed state. not done here, since we want to use it in next state
          sprintf(outstring,"doRoutineWork: MODE_SELECTLINE: Button pressed. Selected trianglePos: %d", trianglePos);
          logOut(2, outstring);
          wData.currentMode = MODE_CHANGEPARAM; // go to change param mode
          menuStartTimer = millis();            // remember timer when gone to change parameter mode
        }
        // safeguard against accidental keypress: if too long in menu, go to routine mode and do measurements
        if((millis() - menuStartTimer) > MAX_MILLIS_IN_MENU){
          wData.currentMode = MODE_RUNNING; // go to measurement mode
          // get anchor position, project it and clear graph buffer if not yet available
          //if(wData.actLat < 0.01 && wData.actLon < 0.01){
          if(wData.anchorLat < 0.01 && wData.anchorLon < 0.01){  
            getGPSStartPosition(&wData.actLat, &wData.actLon); // get averaged boat start position from GPS
            sprintf(outstring,"doRoutineWork: MODE_CHANGEPARAM: Exiting via timer. Current GPS position Lat: %6.4f Lon: %6.4f", 
                wData.actLat, wData.actLon);  
            logOut(2, outstring);
            // project anchor distance and bearing from start position to get anchor position
            gps_offset(wData.actLat, wData.actLon, wData.anchorDistanceM, wData.anchorBearingDeg, &wData.anchorLat, &wData.anchorLon);
            sprintf(outstring,"doRoutineWork: MODE_CHANGEPARAM: Exiting via timer. Anchor position set to Lat: %6.4f Lon: %6.4f", 
                wData.anchorLat, wData.anchorLon);
            logOut(2, outstring);
            //initialize draw buffer
            if(wData.graphBufferClearingNeeded)
              clearGraphBuffer(2);
            updatewData(); // populate wData structure for first run, then no update of gps data expected
          }
          else{
           sprintf(outstring,"leaving menu via timer, re-use existing anchor position %6.6f %6.6f", 
              wData.anchorLat, wData.anchorLon);
            logOut(2, outstring);    
          }
        }
      }       
      break;
    case MODE_CHANGEPARAM:    // 2 input mode to set a specific parameter, defined by last triangePos
      {
        if(!handleParamchanges) // do not draw triangle if already in param change mode, takes too long
        {
          sprintf(outstring,"doRoutineWork: MODE_CHANGEPARAM. wData.Button: %d handleParamchanges: %d", 
              wData.buttonPressed, handleParamchanges);
          logOut(2, outstring);
          drawTriangle(true,INPUTDATA_X_POS, trianglePos * INPUTDATA_FONT_SIZE + INPUTDATA_Y_POS); // draw triangle
        }
        // if button pressed again, and not yet in param change mode, go to param change mode
        if(wData.buttonPressed && !handleParamchanges){
          handleParamchanges = true;
          wData.buttonPressed = false; // reset button pressed state  
          drawTriangle(true,INPUTDATA_X_POS, trianglePos * INPUTDATA_FONT_SIZE + INPUTDATA_Y_POS); // draw triangle once
        }  
        // if button pressed again, and already in param change mode, go back to select line mode
        if(wData.buttonPressed && handleParamchanges){
          handleParamchanges = false;
          wData.buttonPressed = false; // reset button pressed state  
          wData.currentMode = MODE_SELECTLINE; // go to change param mode
          menuStartTimer = millis();            // remember timer when gone to change parameter mode
        } 

        if(handleParamchanges){
          boolean ret = handleParamChange(trianglePos); // handle parameter change within a line
          if(!ret){ // exit parameter change mode, go to running mode - anchor alarm active
            handleParamchanges = false;
            // get anchor position from current GPS position
            getGPSStartPosition(&wData.actLat, &wData.actLon); // get averaged boat start position from GPS
            sprintf(outstring,"doRoutineWork: MODE_CHANGEPARAM: Exiting. Current GPS position Lat: %6.4f Lon: %6.4f", 
                wData.actLat, wData.actLon);  
            logOut(2, outstring);
            // project anchor distance and bearing from start position to get anchor position
            gps_offset(wData.actLat, wData.actLon, wData.anchorDistanceM, wData.anchorBearingDeg, &wData.anchorLat, &wData.anchorLon);
            sprintf(outstring,"doRoutineWork: MODE_CHANGEPARAM: Exiting. Anchor position set to Lat: %6.4f Lon: %6.4f", 
                wData.anchorLat, wData.anchorLon);
            logOut(2, outstring);
            //initialize draw buffer
            if(wData.graphBufferClearingNeeded)
              clearGraphBuffer(1);
            updatewData(); // populate wData structure for first run, then no update of gps data expected
            wData.currentMode = MODE_RUNNING; // go to change param mode
          }
        }  
        // safeguared against accicental keypress: if too long in menu, go to routine mode and do measurements
        if(millis() - menuStartTimer > MAX_MILLIS_IN_MENU)
          wData.currentMode = MODE_RUNNING; // go to measurement mode
      }
      break;  
    case MODE_RUNNING:    // anchor alarm active
      {
        if(!wData.buttonPressed){ // button pressed means: quiet alarm, back to menu
          double startLat = 0.0; double startLon = 0.0;
          sprintf(outstring,"doRoutineWork: MODE_RUNNING ... %d", cnt++);
          logOut(2, outstring);
          
          // we need a bit of time to get the GPS data
          for(int i=0; i<5; i++)
          {  
            //if((gps.location.isUpdated() && gps.location.isValid())) 
            if(gpsTest() == true)
              break;
            smartDelay(1000);  // white, while feeding TinyGPS++
          }    
          
          updatewData();
          sprintf(outstring,"doRoutineWork: MODE_RUNNING: Current GPS position Lat: %6.6f Lon: %6.6f", 
              wData.actLat, wData.actLon);                
          logOut(2, outstring);
          
